var questionsH = [
    {
        q: "ما هي المعركة التي وقعت عام 1571 وشهدت نهاية التفوق البحري العثماني في البحر الأبيض المتوسط ؟",
        answers: ["معركة ليبانتو", "معركة سيواس", "معركة اكتيوم البحريه", "لا شئ مما سبق"],
        correct: 0
    },
    {
        q: "من الشخص الذي خلع نور الدين أيبك من حكم مصر وأصبح سلطانًا للبلاد بدلًا منه ؟",
        answers: ["صلاح الدين الايوبي", "سيف الدين قطز", "ريتشارد قلب الاسد", "موسي ابن النصير"],
        correct: 1
    },
    {
        q: "من هو القائد الأموي الذى رفض محاربة الإمام علي بن أبى طالب ـ رضي الله عنه ـ في معركة صفين ؟",
        answers: ["المعتصم بالله", "ابو عبيده ابن الجراح", "موسي ابن النصير", "لا شئ مما سبق"],
        correct: 2
    },
    {
        q: "اذكر اسم الاتفاقية التي أنهت الحرب الروسية العثمانية والتي قعتها الدولة العثمانية والامبراطورية الروسية في عام 1784م ؟",
        answers: ["اتفاقية القسطنطينيه", "اتفاقية كامب ديفيد", "اتفاقية السلام", "لا شئ مما سبق"],
        correct: 0
    },
    {
        q: "اكتشف كولومبس امريكا عام ؟",
        answers: ["1942", "1945", "1951", "1954"],
        correct: 0
    },
    {
        q: "كيف مات رائد الفضاء الروسي يوري جاجارين ؟",
        answers: ["حادث سياره", "حادث طائره", "حادث قطار", "خطأ ف المكوك الفضائي"],
        correct: 1
    },
    {
        q: "ما ديانة الفاتح المغولي ( تيمور لنك ) ؟",
        answers: ["المسيحيه", "الاصنام", "اليهوديه", "الاسلام"],
        correct: 3
    },
    {
        q: "من أول من نـُــقشَ اسمه على الدنانير والدراهم ؟",
        answers: ["الملك فاروق", "هارون الرشيد", "كسري ملك الفرس", "تيمور لنك"],
        correct: 1
    },
    {
        q: " ما المدينة التي اتخذها الهكسوس عاصمةً لهم في مصر ؟",
        answers: ["القاهره", "اورايس", "طيبه", "وادي النيل"],
        correct: 1
    },
    {
        q: "من هو ثامن خليفة عباسي وهو الذي نقل العاصمة من بغداد الى مدينة (سُرَّ مَن رأى ) عام (220) هجرية ؟",
        answers: ["الحاكم بأمر الله", "المعتصم بالله", "خالد بن الوليد", "لا شئ مما سبق"],
        correct: 1
    },
    {
        q: "بـُويع لهارون الرشيد بالخلافة في اليوم الذي توفي فيه أخوه ' الهادي ' من عام (170) هـ فكم عمر هارون حينها ؟",
        answers: ["20 سنه", "25 سنه", "23 سنه", "27 سنه"],
        correct: 2
    },
    {
        q: "ما معنى كلمة (ماهاتما) في اسم الـ (ماهاتما غاندي ) ؟",
        answers: ["القائد", "الحكيم", "القوي", "الروح العظيمه"],
        correct: 3
    },
    {
        q: "اين انشئ اول برلمان ف العالم ؟",
        answers: ["اليابان", "امريكا", "ايسلندا", "انجلترا"],
        correct: 2
    },
    {
        q: "من اسرة محمد علي من حمل لقب الخديوي فهو ؟",
        answers: ["الخديوي اسماعيل", "الخديوي توفيق", "الخديوي عباس حلمي الثاني", "كل ما سبق"],
        correct: 3
    },
    {
        q: "متي انشأ المتحف المصري ؟",
        answers: ["عام 1898", "عام 1900", "عام 1985", "عام 1915"],
        correct: 0
    },
    {
        q: "من هو الملك الفرعونى الذى قام ببناء أبى الهول ؟",
        answers: ["منقرع", "خوفو", "خفرع", "امنحتب الثاني"],
        correct: 2
    },
    {
        q: "فى أى عام احتلت الدولة العثمانية مصر ؟",
        answers: ["عام 1517", " عام 1520", " عام 1525", " عام 1527"],
        correct: 0
    },
    {
        q: " متى وُلد الزعيم الوطنى أحمد عرابى ؟",
        answers: ["عام 1951", "عام 1849", "عام 1847", "عام 1841"],
        correct: 3
    },
    {
        q: "متى توفى صلاح الدين الأيوبى ؟",
        answers: ["عام 589 هجريا", "عام 591 هجريا", "عام 593 هجريا", "عام 595 هجريا"],
        correct: 0
    },
    {
        q: " كم سنة استغرقها السير «فرانسيس دريك» لإكمال أول رحلة مطولة حول العالم في عام 1580؟",
        answers: ["سنه واحده", "سنتين", "ثلاث سنوات", "اربع سنوات"],
        correct: 2
    },
    {
        q: "ماهي اللغة التي كان يتكلمها المسيح عليه السلام ؟",
        answers: ["اللاتينيه", "العربيه", "الاراميه", "لا شئ مما سبق"],
        correct: 2
    },
    {
        q: "ما اسم عاصمة مصر الفرعونية فى عهد المملكة القديمة ؟",
        answers: ["طيبه", "اواريس", "وادي الملوك", "ممفيس"],
        correct: 3
    },
    {
        q: "من أول من ظهرت صورته على طابع بريد (من غير الملوك ) ؟",
        answers: ["ويليام شكسبير", "فان كوخ", "ارمسترونج", "ليوناردو دافنشي"],
        correct: 0
    },
    {
        q: "ممن اشترت أمريكا ولاية لويزيانا ؟",
        answers: ["ايطاليا", "فرنسا", "بلجيكا", "اسبانيا"],
        correct: 1
    },
    {
        q: "اين اصدر اول طابع حكومي ف العالم ؟",
        answers: ["امريكا", "فرنسا", "النرويج", "هولندا"],
        correct: 3
    },
    {
        q: "ما العاصمة السابقة لروسيا قبل موسكو ؟",
        answers: ["سارانسك", "بطرسبرج", "سامارا", "كالينينغراد"],
        correct: 1
    },
    {
        q: "الأوس والخزرج هما في الأصل بطنان من قبيلة واحدة فما هي هذه القبيلة ؟",
        answers: ["قبيلة قريش", "قبيلة بني عبس", "قبيلة الأزذ", "لا شئ مما سبق"],
        correct: 2
    },
    {
        q: "من أول رئيس أمريكي كاثوليكي ؟",
        answers: ["جورج بوش", "جون كينيدي", "باراك اوباما", "دونالد ترامب"],
        correct: 1
    },
    {
        q: "كان السواد شعارالعباسيين واللون الأخضر شعار الفاطميين فماذاكان لون شعار العثمانيين ؟",
        answers: ["البنفسجي", "الازرق", "الابيض", "القرمزي"],
        correct: 0
    },
    {
        q: "أين يوجد قبر صلاح الدين الأيوبى ؟",
        answers: ["دمشق", "لبنان", "فلسطين", "القاهره"],
        correct: 0
    },
    {
        q: "متى قامت معركة العالمين ؟",
        answers: ["عام 1942", "عام 1953", "عام 1963", "عام 1972"],
        correct: 0
    },
    {
        q: " من الخليفة الذي أنشأ دار الحكمة ؟",
        answers: ["المعتصم بالله", "عمر بن الخطاب", "بايزيد الاول", "الحاكم بأمرالله"],
        correct: 3
    },
    {
        q: "متى تم افتتاح حديقة حيوانات الجيزة ؟",
        answers: ["عام 1900", "عام 1890", "عام 1910", "عام 1920"],
        correct: 1
    },
    {
        q: "لقب الخديوي من اصل ؟",
        answers: ["تركي", "عربي", "هندي", "فارسي"],
        correct: 3
    },
    {
        q: "قوانين حامورابي الشهيرة هي أقدم قوانين ظهرت على وجه الأرض فأين توجد هذه القوانين حاليًا ؟",
        answers: ["متحف القاهره", "متحف اللوفر", "الاقصر", "لا شئ مما سبق"],
        correct: 1
    },
    {
        q: "خوفو وخفرع ومنقرع الي اي اسره ينتمون ؟",
        answers: ["الاسره الرابعه", "الاسره الخامسه", "الاسره السادسه", "الاسره السابعه"],
        correct: 0
    },
]