var questionsC = [ // the questions here
    {
        q: "ماهو ملح الطعام ؟",
        answers: ["برمنجنات البوتاسيوم", "كلوريد الصوديوم", "ثيوثيانات الحديد", "كبريتات البوتاسيوم"],
        correct: 1
    },
    {
        q: " ما اسم العنصر الكيميائي الذي يعتبر الهواء النقي الذي تتنفسه المخلوقات والناس ؟",
        answers: ["الهيدروجين", " الاكسجين", "النيتروجين", "الهيليوم"],
        correct: 1
    },
    {
        q: "ما اسم العنصر الوحيد الي يظهر بحالته السائله ؟",
        answers: ["الزئبق", "الليثيوم", "الكالسيوم", "البوتاسيوم"],
        correct: 0
    },{
        q: "ماهو اهم المعادن التي تستخدم ف صناعة الطائرات ؟",
        answers: ["الحديد", "الالومنيوم", "النحاس", "التيتانيوم"],
        correct: 1
    },
    {
        q: "كم عدد ذرات الاكسجين التي يجب ان تكون مع الهيدروجين ف مركب الماء ؟",
        answers: ["ذره واحده", "ذرتين", "ثلاث ذرات", "لا يدخل ف التركيب"],
        correct: 0
    },
    {
        q: "ما اسم الغاز الذي يستخدم ف تعبئة البالونات الغازيه الطائره ؟",
        answers: ["الميثان", "ثاني اكسيد الكربون", "الهيليوم", "النيون"],
        correct: 2
    },
    {
        q: "فركتوز ولاكتوز وجلوكوز من اسماء ؟",
        answers: ["السكر", "الأرز", "الملح", "غير ما سبق"],
        correct: 0
    },
    {
        q: "العناصر التاليه لا تملك رائحه ولا لون ولا طعم ماعدا عنصر واحد وهو ؟",
        answers: ["الكريبتون", "الهيدروجين", "النيون", "الكلور"],
        correct: 3
    },
    {
        q: "ما اسم اثقل عنصر طبيعي من العناصر الطبيعيه ؟",
        answers: ["البلاتين", "اليورانيوم", "روديوم", "الرصاص"],
        correct: 1
    },
    {
        q: "كم عدد العناصر الطبيعيه الموجوده حاليا ؟",
        answers: ["118 عنصر", "50 عنصر", "84 عنصر", "92 عنصر"],
        correct: 3
    },
    {
        q: "ماهي افران  اختزال الحديد ؟",
        answers: ["الفرن العالي", "فرن مدركس", "الفرن الحراري", "الاولي والثانيه"],
        correct: 3
    },
    {
        q: "ماهي افران انتاج الحديد ؟",
        answers: ["الفرن الكهربائي", "المحول الاكسجيني", "الفرن المفتوح", "كل ما سبق"],
        correct: 3
    },
    {
        q: "سبيكه بينيه عباره عن الحديد والصلب ؟",
        answers: ["حديد الصلب", "صلب لا يصدأ", "صلب كربوني", "كل ما سبق"],
        correct: 0
    },
    {
        q: "سبيكه استبداليه عباره عن حديد وكروم ؟",
        answers: ["حديد الصلب", "صلب لا يصدأ", "صلب كربوني", "كل ما سبق"],
        correct: 1
    },
    {
        q: "مركب رمزه الكيميائي ( FE3C ) ماهو ؟",
        answers: ["سيمنتيت", "ماجنيت", "هيماتيت", "ماجنيت"],
        correct: 0
    },
    {
        q: "من هو اول من حضر حامض الكبريتيك ؟",
        answers: ["توماس اديسون", "اينشتاين", "ابن بطوطه", "جابر ابن حيان"],
        correct: 3
    },
    {
        q: "متي بدأ استخدام كلمة ( كيمياء ) ؟",
        answers: ["القرن الثامن عشر", "القرن السابع عشر", "القرن السادس عشر", "القرن الخامس عشر"],
        correct: 1
    },
    {
        q: "(النطرون ) هو اسم قديم لمادة ؟",
        answers: ["حمش الكبريتيك", "كربونات الصوديوم", "كبريتات البوتاسيوم", "كلوريد الصوديوم"],
        correct: 1
    },
    {
        q: "السيليومين هي سبيكه من ؟",
        answers: ["سيليكون وزرنيخ", "حديد وصلب", "الالومنيوم والسيليكون", "حديد ونحاس"],
        correct: 0
    },
    {
        q: "مركب رمزه الكيميائي ( FE3C ) ماهو ؟",
        answers: ["سيمنتيت", "ماجنيت", "هيماتيت", "ماجنيت"],
        correct: 0
    },
    {
        q: "رمز عنصر الحديد هو ؟",
        answers: ["Fe", "Cl", "Na", "M"],
        correct: 0
    },
    {
        q: "رمز عنصر الصوديوم هو ؟",
        answers: ["Fe", "Cl", "Na", "M"],
        correct: 2
    },
    {
        q: "رمز عنصر الكلور هو ؟",
        answers: ["Fe", "Cl", "Na", "M"],
        correct: 1
    },
    {
        q: "تتكون الذره من شحنات موجبه وسالبه تسمي ؟",
        answers: ["البروتونات والنيوترونات", "البروتونات والالكترونات", "شحنات متعادله", "لا شئ مما سبق"],
        correct: 1
    },
    {
        q: "الرمز الكيميائي لمركب هيدروكسيد الصوديوم هو ؟",
        answers: ["NaCl", "FeOH", "NaOH", "Fe3C"],
        correct: 2
    },
    {
        q: " يتمدد الماء عند تجمده بنسبة ؟",
        answers: ["8 %", "9 %", "15 %", "18 %"],
        correct: 1
    },
    {
        q: "ماهو الغاز المستخدم ف المصابيح ؟",
        answers: ["النيون", "الارجون", "الهيدروجين", "الاكسجين"],
        correct: 1
    },
    {
        q: "ماهو العنصر الموجود ف كل البروتينات ؟",
        answers: ["النيتروجين", "الهيدروجين", "الحديد", "المنجنيز"],
        correct: 0
    },
    {
        q: "ماهي الماده الخام ف صنع الزجاج ؟",
        answers: ["التراب", "الحديد", "النحاس", "الرمل"],
        correct: 3
    },
    {
        q: "ماهو الاسم الكيميائي للطباشير ؟",
        answers: ["كبريتات المنجنيز", "كلوريد الصوديوم", "كربونات الكالسيوم", "الاكسجين"],
        correct: 2
    },
    {
        q: "ما هي اكثر ماده تقاوم الصدأ ؟",
        answers: ["استانليستيل", "الحديد", "الالومنيون", "النحاس"],
        correct: 0
    },
    {
        q: "من استخدامات حمض البوريك ؟",
        answers: ["التحنيط", "التعقيم", "الصهر", "عامل مساعد"],
        correct: 1
    },
    {
        q: "ماهو خام المغنيسات ؟",
        answers: ["كبريتات الماغنيسويم", "كربونات الماغنيسيوم", "هيروكسيد الماغنيسويم", "الماغنيسيوم"],
        correct: 1
    },
    {
        q: "ماهو العنصر الثاني من حيث وفرته ف البحر بعد الصوديوم ؟",
        answers: ["المنجنيز", "النحاس", "الماغنيسيوم", "الكلور"],
        correct: 2
    },
    {
        q: "ف ماذا تستخدم نترات الصوديوم ؟",
        answers: ["الحديد الصلب", "الاسمنت", "الدهانات", "الاسمده"],
        correct: 3
    },




    {
        q: " يذوب الصابون الصوديومي بسهولة في الماء وبصعوبة في المذيبات العضوية لوجوده بشكل",
        answers: ["ايوني", "عضوي", "الاولي والثانيه", "لاشئ مما سبق"],
        correct: 0
    },{
        q: "من هو العالم الذي اكتشف الجدول الدوري ؟",
        answers: ["اينشتين", "رذرفورد", "مندليف", "نيوتن"],
        correct: 2
    },
    {
        q: "لماذا لايستخدم الذهب و الفضة في صناعة المجوهرات أو العملات المعدنية دون إضافات . ؟",
        answers: ["غالية الثمن", "صعبة الحصول عليها", "صلابتها ضعيفه", "كل ما سبق"],
        correct: 3
    },
    {
        q: "العناصر الارضيه النادره هي ؟",
        answers: ["الحديد", "الذهب", "اللانثانيدات", "الاكتانيدات"],
        correct: 2
    },
]